export interface HealthData {
    id: string;
    userName: string
    heartRateData: number[];
    averageHeartRate: string;
    hrvData: number[];
    averageHRV: string;
    bloodOxygenData: number[];
    averageOxygen: string;
    baseTemperatureData: number[];
    averageTemperature: string;
}

export interface UserData {
    id: string;
    name: string;
    lastName: string;
    avatarUrl?: string;
    position?: string;
}

export const dataUser0: HealthData = {
    id: "0",
    userName: "",
    heartRateData: [
        // Ночь (низкие значения во время сна)
        58, 57, 56, 58, 57, 59, // 00:00 - 03:00 (глубокий сон)

        // Раннее утро (постепенное повышение при пробуждении)
        62, 64, 68, 72, 76, 78, // 03:00 - 06:00 (пробуждение)

        // Утро (повышенная активность)
        83, 87, 89, 90, 88, 86, // 06:00 - 09:00 (утренняя активность, завтрак)

        // День (стабильная активность)
        82, 84, 83, 85, 86, 83, // 09:00 - 12:00 (рабочее время)

        // Обед (небольшое повышение после еды)
        86, 89, 87, 85, 82, 81, // 12:00 - 15:00 (обед и послеобеденный период)

        // День (умеренная активность)
        83, 85, 87, 88, 86, 84, // 15:00 - 18:00 (послеобеденная активность)

        // Вечер (постепенное снижение)
        80, 77, 75, 73, 70, 68, // 18:00 - 21:00 (вечерний отдых)

        // Ночь (подготовка ко сну)
        65, 63, 61, 60, 59, 58  // 21:00 - 00:00 (засыпание)
    ],
    averageHeartRate: "76",
    hrvData: [
        // Ночь (высокая ВСР во время глубокого сна)
        75, 78, 80, 79, 77, 76, // 00:00 - 03:00 (высокая ВСР при глубоком сне)

        // Раннее утро (снижение при пробуждении)
        72, 68, 60, 52, 45, 40, // 03:00 - 06:00 (снижение при росте ЧСС)

        // Утро (низкая ВСР при высокой активности)
        32, 28, 30, 27, 29, 31, // 06:00 - 09:00 (низкая ВСР при высокой ЧСС)

        // День (умеренная ВСР при стабильной активности)
        35, 33, 34, 32, 31, 34, // 09:00 - 12:00 (умеренная ВСР при средней ЧСС)

        // Обед (низкая ВСР после еды)
        29, 26, 28, 32, 36, 38, // 12:00 - 15:00 (ВСР снижается после еды)

        // День (умеренная ВСР при умеренной активности)
        33, 31, 29, 28, 30, 32, // 15:00 - 18:00 (умеренная ВСР)

        // Вечер (рост ВСР при снижении активности)
        38, 42, 46, 50, 55, 60, // 18:00 - 21:00 (повышение ВСР вечером)

        // Ночь (высокая ВСР при засыпании)
        65, 68, 72, 74, 76, 77  // 21:00 - 00:00 (высокая ВСР при засыпании)
    ],
    averageHRV: "47",
    bloodOxygenData: [
        // Ночь (значения при глубоком сне, немного снижены)
        96.5, 96.3, 96.2, 96.4, 96.3, 96.5, // 00:00 - 03:00

        // Раннее утро (постепенное повышение при пробуждении)
        96.7, 96.9, 97.0, 97.2, 97.4, 97.5, // 03:00 - 06:00

        // Утро (нормальные высокие значения при активности)
        97.8, 97.6, 97.7, 97.6, 97.8, 97.9, // 06:00 - 09:00

        // День (стабильные значения)
        98.0, 98.1, 98.0, 98.2, 98.1, 98.0, // 09:00 - 12:00

        // Обед (небольшое снижение после еды)
        97.8, 97.6, 97.7, 97.9, 98.0, 98.1, // 12:00 - 15:00

        // День (нормальные значения)
        98.2, 98.0, 97.9, 97.8, 98.0, 98.1, // 15:00 - 18:00

        // Вечер (стабильные нормальные значения)
        98.0, 97.9, 97.8, 97.7, 97.6, 97.5, // 18:00 - 21:00

        // Ночь (постепенное снижение при засыпании)
        97.3, 97.0, 96.8, 96.7, 96.6, 96.5  // 21:00 - 00:00
    ],
    averageOxygen: "97.4",
    baseTemperatureData: [
        // Ночь (самые низкие значения)
        33.8, 33.7, 33.6, 33.6, 33.6, 33.7, // 00:00 - 03:00

        // Раннее утро (начало повышения)
        33.8, 33.9, 34.0, 34.1, 34.2, 34.3, // 03:00 - 06:00

        // Утро (повышение)
        34.4, 34.5, 34.6, 34.7, 34.8, 34.9, // 06:00 - 09:00

        // День (стабильно высокая)
        35.0, 35.1, 35.1, 35.2, 35.2, 35.2, // 09:00 - 12:00

        // Обед (небольшой подъем после еды)
        35.3, 35.4, 35.4, 35.3, 35.3, 35.3, // 12:00 - 15:00

        // День (пик температуры)
        35.4, 35.5, 35.6, 35.7, 35.7, 35.6, // 15:00 - 18:00

        // Вечер (начало снижения)
        35.5, 35.4, 35.3, 35.2, 35.1, 35.0, // 18:00 - 21:00

        // Ночь (снижение к ночи)
        34.8, 34.6, 34.4, 34.2, 34.0, 33.9  // 21:00 - 00:00
    ],
    averageTemperature: "34.7"
}

export const dataUser1: HealthData = {
    id: "1",
    userName: "Олексій Лисенко",
    heartRateData: [88, 81, 84, 79, 82, 75, 82, 86, 90, 85, 93, 88, 83, 80, 77, 83, 89, 79, 77, 85, 86, 84, 75, 90, 76, 80, 80, 87, 80, 90, 94, 76, 92, 88, 77, 82, 78, 93, 95, 84, 76, 76, 76, 78, 86, 85, 77, 81],
    averageHeartRate: "83",
    hrvData: [35, 47, 40, 51, 49, 36, 53, 24, 48, 51, 37, 30, 30, 48, 45, 35, 42, 42, 41, 30, 50, 38, 52, 40, 47, 49, 54, 41, 51, 34, 28, 50, 46, 52, 35, 52, 39, 33, 32, 29, 39, 52, 50, 32, 43, 36, 28, 30],
    averageHRV: "41",
    bloodOxygenData: [97.0, 95.9, 96.0, 97.5, 97.0, 95.9, 96.4, 97.6, 97.6, 97.2, 97.1, 96.6, 96.3, 95.8, 96.4, 96.3, 96.9, 97.3, 97.0, 96.1, 97.2, 95.8, 96.1, 96.2, 96.3, 96.3, 96.3, 96.9, 97.5, 96.7, 96.3, 96.6, 97.3, 96.9, 96.7, 96.6, 97.2, 95.9, 97.2, 97.7, 97.2, 96.3, 96.5, 96.3, 95.9, 96.4, 97.2, 96.7],
    averageOxygen: "96.7",
    baseTemperatureData: [34.9, 34.4, 34.4, 35.3, 34.4, 35.2, 34.1, 35.2, 34.4, 35.2, 35.1, 34.6, 34.5, 34.8, 34.1, 34.9, 35.2, 34.9, 34.3, 34.5, 35.1, 35.4, 34.8, 34.3, 34.9, 35.3, 34.8, 34.5, 34.4, 34.3, 34.4, 34.2, 34.8, 34.6, 35.1, 34.1, 34.5, 34.9, 34.8, 35.1, 35.3, 34.7, 35.3, 34.5, 35.3, 34.8, 35.4, 34.3],
    averageTemperature: "34.8"
};

export const dataUser2: HealthData = {
    id: "2",
    userName: "Марія Шевченко",
    heartRateData: [62, 76, 63, 62, 60, 76, 66, 65, 72, 63, 77, 60, 74, 60, 70, 70, 66, 63, 60, 76, 69, 70, 66, 72, 57, 72, 68, 62, 60, 65, 63, 58, 58, 60, 69, 62, 125, 121, 127, 113, 57, 64, 68, 72, 59, 62, 76, 64],
    averageHeartRate: "66",
    hrvData: [49, 37, 56, 58, 50, 58, 41, 42, 58, 34, 48, 58, 40, 57, 30, 31, 44, 46, 41, 58, 40, 33, 41, 47, 37, 53, 58, 32, 43, 31, 41, 34, 38, 55, 37, 42, 10, 19, 20, 10, 53, 45, 37, 44, 41, 36, 58, 55],
    averageHRV: "45",
    bloodOxygenData: [97.5, 98.4, 98.7, 98.2, 97.0, 98.2, 98.4, 97.2, 98.1, 97.9, 98.1, 98.5, 97.8, 98.6, 97.5, 97.5, 98.5, 97.8, 97.4, 97.8, 97.2, 98.5, 96.9, 96.9, 97.8, 98.3, 97.5, 96.8, 97.5, 97.0, 97.7, 96.9, 97.3, 98.2, 97.6, 98.1, 98.4, 97.9, 98.6, 98.4, 97.4, 97.6, 97.1, 98.1, 97.0, 97.7, 98.5, 98.7],
    averageOxygen: "97.8",
    baseTemperatureData: [34.7, 34.9, 34.6, 35.1, 35.5, 35.1, 35.1, 34.5, 34.6, 35.4, 35.6, 35.5, 34.9, 35.2, 34.7, 35.2, 35.7, 35.6, 35.2, 34.4, 35.4, 35.2, 34.5, 34.7, 35.1, 35.5, 34.4, 35.5, 34.6, 34.8, 34.8, 34.6, 35.6, 34.9, 35.3, 35.7, 34.4, 34.9, 35.7, 35.5, 35.3, 35.0, 35.2, 34.5, 34.4, 34.7, 34.6, 34.4],
    averageTemperature: "35.0"
};

export const dataUser3: HealthData = {
    id: "3",
    userName: "Іван Ковальчук",
    heartRateData: [89, 80, 76, 91, 81, 79, 85, 73, 75, 81, 90, 80, 88, 75, 75, 74, 73, 80, 77, 90, 78, 86, 72, 76, 86, 77, 79, 73, 75, 84, 84, 80, 86, 73, 81, 80, 76, 77, 79, 83, 91, 87, 91, 80, 72, 77, 72, 88],
    averageHeartRate: "80",
    hrvData: [48, 31, 26, 50, 55, 45, 45, 43, 53, 49, 47, 39, 32, 37, 36, 38, 34, 50, 33, 55, 53, 42, 36, 35, 42, 44, 36, 49, 42, 45, 36, 38, 43, 54, 27, 33, 48, 31, 44, 37, 52, 50, 41, 53, 42, 41, 38, 44],
    averageHRV: "42",
    bloodOxygenData: [97.2, 96.3, 97.8, 96.2, 96.9, 98.0, 97.4, 96.5, 97.5, 97.9, 98.0, 97.3, 97.0, 96.8, 97.5, 96.5, 96.6, 96.7, 96.9, 96.7, 97.6, 97.3, 97.9, 97.6, 97.3, 97.9, 96.7, 96.3, 96.7, 97.9, 98.2, 97.5, 96.2, 96.8, 96.5, 96.5, 97.0, 97.0, 96.6, 97.7, 96.5, 97.4, 97.7, 97.8, 98.0, 97.2, 97.0, 97.6],
    averageOxygen: "97.2",
    baseTemperatureData: [34.4, 34.5, 34.7, 34.6, 34.3, 34.6, 33.5, 34.6, 34.6, 33.8, 33.9, 34.7, 34.6, 33.7, 34.1, 34.9, 33.5, 34.9, 34.8, 33.7, 34.2, 34.8, 34.8, 33.7, 33.8, 33.6, 34.3, 34.4, 33.6, 34.1, 34.5, 34.4, 34.1, 34.2, 33.5, 33.6, 34.5, 34.9, 34.4, 34.3, 33.8, 33.9, 34.9, 34.3, 33.7, 34.6, 33.7, 34.8],
    averageTemperature: "34.2"
};

export const dataUser4: HealthData = {
    id: "4",
    userName: "Анастасія Мельник",
    heartRateData: [89, 89, 89, 86, 75, 74, 91, 88, 92, 88, 92, 74, 74, 73, 75, 82, 75, 82, 75, 74, 74, 74, 74, 92, 78, 80, 74, 74, 83, 91, 82, 80, 76, 78, 85, 74, 90, 74, 89, 92, 87, 74, 91, 79, 90, 76, 80, 89],
    averageHeartRate: "82",
    hrvData: [36, 60, 37, 55, 34, 50, 31, 44, 36, 60, 32, 46, 44, 55, 37, 42, 58, 33, 53, 58, 34, 43, 57, 59, 42, 33, 47, 50, 35, 39, 59, 36, 51, 60, 35, 48, 33, 58, 43, 55, 45, 37, 46, 41, 31, 48, 39, 58],
    averageHRV: "45",
    bloodOxygenData: [98.2, 97.4, 98.8, 98.2, 98.6, 97.2, 98.2, 97.2, 98.6, 98.4, 97.7, 98.5, 97.1, 98.8, 97.6, 97.4, 98.2, 97.5, 97.7, 98.3, 98.3, 98.3, 97.2, 98.5, 97.3, 98.0, 97.9, 97.9, 97.5, 98.4, 96.9, 97.0, 97.9, 97.4, 98.0, 96.8, 97.9, 96.9, 98.3, 98.6, 97.3, 97.3, 98.0, 97.4, 98.3, 98.5, 98.0, 98.6],
    averageOxygen: "97.9",
    baseTemperatureData: [34.5, 34.3, 35.3, 34.6, 34.4, 34.2, 34.5, 34.3, 35.1, 34.4, 35.1, 34.5, 35.4, 34.5, 34.5, 34.3, 34.2, 34.8, 34.6, 34.9, 35.5, 34.4, 34.3, 34.4, 34.8, 34.9, 34.4, 35.0, 34.6, 34.5, 34.6, 35.1, 35.3, 34.5, 34.2, 35.5, 35.3, 34.5, 34.5, 34.3, 34.3, 35.4, 35.3, 34.6, 35.3, 35.0, 34.9, 35.2],
    averageTemperature: "34.7"
};

export const dataUser5: HealthData = {
    id: "5",
    userName: "Дмитро Сидоренко",
    heartRateData: [76, 80, 78, 79, 74, 87, 83, 69, 83, 72, 74, 79, 69, 72, 75, 71, 83, 77, 77, 86, 81, 88, 83, 81, 77, 86, 77, 80, 75, 77, 75, 80, 81, 72, 81, 72, 120, 119, 121, 126, 70, 77, 80, 79, 74, 78, 80, 73],
    averageHeartRate: "78",
    hrvData: [48, 48, 40, 52, 44, 29, 26, 31, 26, 31, 30, 28, 27, 39, 34, 50, 42, 31, 36, 51, 45, 50, 24, 35, 34, 24, 31, 51, 32, 43, 46, 51, 36, 41, 31, 47, 16, 16, 17, 18, 49, 36, 34, 52, 46, 52, 51, 40],
    averageHRV: "39",
    bloodOxygenData: [97.3, 97.3, 97.1, 96.6, 97.4, 96.4, 97.4, 96.3, 97.5, 98.0, 96.6, 97.7, 97.3, 97.4, 96.6, 97.2, 98.2, 97.4, 97.1, 96.7, 97.8, 96.5, 96.8, 97.4, 96.5, 98.2, 98.2, 97.9, 97.8, 97.2, 97.5, 98.2, 98.2, 98.0, 96.4, 96.9, 96.3, 96.3, 97.5, 97.0, 97.9, 96.3, 96.4, 98.1, 96.5, 97.5, 97.5, 97.0],
    averageOxygen: "97.2",
    baseTemperatureData: [34.6, 34.7, 33.7, 34.7, 33.8, 33.7, 34.6, 34.0, 34.3, 34.8, 33.7, 33.6, 33.5, 33.6, 34.7, 34.9, 34.7, 33.9, 34.2, 34.8, 33.6, 34.3, 33.9, 34.6, 34.7, 34.9, 34.3, 34.1, 34.4, 33.6, 33.5, 33.7, 33.6, 33.5, 34.5, 33.7, 34.4, 34.8, 34.3, 33.6, 34.6, 34.2, 34.6, 34.9, 33.6, 33.5, 34.7, 33.6],
    averageTemperature: "34.2"
};

export const mockUsers: UserData[] = [
    {
        id: "1",
        name: "Олексій Лисенко",
        lastName: " ",
        avatarUrl: "https://i.pravatar.cc/150?img=59",
        position: "21 рік",
    },
    {
        id: "2",
        name: "Марія",
        lastName: "Шевченко",
        avatarUrl: "https://i.pravatar.cc/150?img=5",
        position: "23 роки",
    },
    {
        id: "3",
        name: "Іван",
        lastName: "Ковальчук",
        avatarUrl: "https://i.pravatar.cc/150?img=8",
        position: "25 років",
    },
    {
        id: "4",
        name: "Анастасія",
        lastName: "Мельник",
        avatarUrl: "https://i.pravatar.cc/150?img=26",
        position: "22 роки",
    },
    {
        id: "5",
        name: "Дмитро",
        lastName: "Сидоренко",
        avatarUrl: "https://i.pravatar.cc/150?img=68",
        position: "24 роки",
    },
];